models/tables/BookSearch.php

SELECT * FROM `genre`
---
    public function getGenreList()
    {
        $list = Genre::find()->asArray()->all();

SELECT * FROM `author`
---
    public function getAuthorList()
    {
        $list = Author::find()->asArray()->all();